In [23]:
import pandas as pd
import numpy as np
import glob
import os

In [24]:
# Path to the directory containing your Parquet files
directory_path = 'C:/Users/comma/Github/workspace/sas-access-samples/SAS Foundation/parquetdataset/'

# Use glob to find all Parquet files in the directory
parquet_file_paths = glob.glob(directory_path + '*.parquet')

# Initialize an empty dictoionary to store the DataFrames
dfs = {}

In [25]:
# Function to decode bytes to string if the value is a byte literal
def decode_bytes(val):
    if isinstance(val, bytes):
        return val.decode('utf-8')
    return val

In [26]:
# Loop through the file paths
for path in parquet_file_paths:
    # Extract the base file name without the extension as the dictionary key
    file_name = path.split('/')[-1].replace('.parquet', '')
    
    # Read each file into a DataFrame
    df = pd.read_parquet(path)
    
    # Apply the decode_bytes function to each column using Series.map
    for col in df.columns:
        df[col] = df[col].map(decode_bytes)
    
    # Store the DataFrame in the dictionary with the file name as the key
    dfs[file_name] = df

In [27]:
df1 = dfs['parquetdataset\\samdat1']
df2 = dfs['parquetdataset\\samdat2']
df3 = dfs['parquetdataset\\samdat3']
df4 = dfs['parquetdataset\\samdat4']
df5 = dfs['parquetdataset\\samdat5']
df6 = dfs['parquetdataset\\samdat6']
df7 = dfs['parquetdataset\\samdat7']
df8 = dfs['parquetdataset\\samdat8']
df9 = dfs['parquetdataset\\samdat9']
df10 = dfs['parquetdataset\\samdat10']
df11 = dfs['parquetdataset\\samdat11']
df12 = dfs['parquetdataset\\samdat12']
df13 = dfs['parquetdataset\\samdat13']

In [28]:
df1.info()
df2.info()
df3.info()
df4.info()
df5.info()
df6.info()
df7.info()
df8.info()
df9.info()
df10.info()
df11.info()
df12.info()
df13.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FLIGHT    46 non-null     object
 1   DATES     46 non-null     datetime64[ns]
 2   DEPART    46 non-null     float64
 3   ORIG      46 non-null     object
 4   DEST      46 non-null     object
 5   MILES     46 non-null     float64
 6   BOARDED   46 non-null     float64
 7   CAPACITY  46 non-null     float64
dtypes: datetime64[ns](1), float64(4), object(3)
memory usage: 3.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FLIGHT    46 non-null     object
 1   DATES     46 non-null     datetime64[ns]
 2   ORIG      46 non-null     object
 3   DEST      46 non-null     object
 4   DELAYCAT  46 non-null     object
 5   DESTYPE   46 non-null     object
 6   DELAY     46 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 2.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   FLIGHT   26 non-null     object
 1   DATES    26 non-null     datetime64[ns]
 2   DEST     26 non-null     object
 3   BOARDED  26 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 964.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   FLIGHT  156 non-null    object
 1   DATES   156 non-null    datetime64[ns]
 2   DEST    156 non-null    object
 3   IDNUM   156 non-null    object
dtypes: datetime64[ns](1), object(3)
memory usage: 5.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   IDNUM    148 non-null    object
 1   SEX      148 non-null    object
 2   JOBCODE  148 non-null    object
 3   SALARY   148 non-null    float64
 4   BIRTH    148 non-null    datetime64[ns]
 5   HIRED    148 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 7.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   IDNUM    12 non-null     object
 1   SEX      12 non-null     object
 2   JOBCODE  12 non-null     object
 3   SALARY   12 non-null     float64
 4   BIRTH    12 non-null     datetime64[ns]
 5   HIRED    12 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 708.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   IDNUM   148 non-null    object
 1   LNAME   148 non-null    object
 2   FNAME   148 non-null    object
 3   CITY    148 non-null    object
 4   STATE   148 non-null    object
 5   HPHONE  148 non-null    object
dtypes: object(6)
memory usage: 7.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   SUPID   19 non-null     object
 1   STATE   19 non-null     object
 2   JOBCAT  19 non-null     object
dtypes: object(3)
memory usage: 588.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   INVNUM    17 non-null     float64
 1   BILLEDTO  17 non-null     object
 2   AMTBILL   17 non-null     float64
 3   COUNTRY   17 non-null     object
 4   AMTINUS   17 non-null     float64
 5   BILLEDBY  17 non-null     float64
 6   BILLEDON  17 non-null     datetime64[ns]
 7   PAIDON    10 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(4), object(2)
memory usage: 1.2+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPID     22 non-null     float64
 1   HIREDATE  22 non-null     datetime64[ns]
 2   SALARY    21 non-null     float64
 3   DEPT      22 non-null     object
 4   JOBCODE   22 non-null     float64
 5   GENDER    21 non-null     object
 6   BIRTHDTE  21 non-null     datetime64[ns]
 7   LASTNAME  22 non-null     object
 8   FRSTNAME  22 non-null     object
 9   MIDNAME   22 non-null     object
 10  PHONE     21 non-null     object
dtypes: datetime64[ns](2), float64(3), object(6)
memory usage: 2.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   CUSTOMER  21 non-null     object
 1   STATE     11 non-null     object
 2   ZIPCODE   15 non-null     object
 3   COUNTRY   20 non-null     object
 4   PHONE     21 non-null     object
 5   NAME      20 non-null     object
 6   CONTACT   19 non-null     object
 7   ADDRESS   20 non-null     object
 8   CITY      20 non-null     object
 9   FIRSTORD  21 non-null     datetime64[ns]
dtypes: datetime64[ns](1), object(9)
memory usage: 1.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ORDERNUM  38 non-null     float64
 1   STOCKNUM  38 non-null     float64
 2   LENGTH    38 non-null     float64
 3   FABCHARG  24 non-null     float64
 4   SHIPTO    38 non-null     object
 5   DATEORD   38 non-null     datetime64[ns]
 6   SHIPPED   15 non-null     datetime64[ns]
 7   TAKENBY   38 non-null     float64
 8   PROCSBY   15 non-null     float64
 9   SPECFLAG  10 non-null     object
dtypes: datetime64[ns](2), float64(6), object(2)
memory usage: 3.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPID     6 non-null      float64
 1   HIREDATE  6 non-null      datetime64[ns]
 2   DEPT      6 non-null      object
 3   GENDER    5 non-null      object
 4   LASTNAME  6 non-null      object
 5   FIRSTNAM  6 non-null      object
 6   MIDDLENA  5 non-null      object
 7   FAMILYID  2 non-null      float64
dtypes: datetime64[ns](1), float64(2), object(5)
memory usage: 516.0+ bytes

In [29]:
## Sample #1

# Filter the DataFrame for rows where state is 'NJ' and select specific columns
filtered_df7 = df7[df7['STATE'] == 'NJ'][['LNAME', 'FNAME', 'STATE', 'HPHONE']]

# Display the title
print('Libname Sample 1: New Jersey Phone List')

# Display the filtered DataFrame
print(filtered_df7)
filtered_df7.info()

#row_count=filtered_df7.shape[0]
#column_count=filtered_df7.shape[1]
#print("No.of rows: ", row_count)
#print("No.of columns: ", column_count)
#print("Column names:", filtered_df7.columns.tolist())

Libname Sample 1: New Jersey Phone List
         LNAME    FNAME STATE        HPHONE
17      RHODES   JEREMY    NJ  201/812-1837
62     ALVAREZ   CARLOS    NJ  201/732-8787
66       DACKO    JASON    NJ  201/732-2323
69   HENDERSON  WILLIAM    NJ  201/812-4789
72     JOHNSON  JACKSON    NJ  201/732-3678
73     MURPHEY     JOHN    NJ  201/812-4414
74      PETERS  RANDALL    NJ  201/812-2478
77     NEWKIRK  WILLIAM    NJ  201/732-6611
79       ROUSE   JEREMY    NJ  201/732-9834
81    FUJIHARA    KYOKO    NJ  201/812-0902
85        VICK  THERESA    NJ  201/812-2424
92      YANCEY    ROBIN    NJ  201/812-1874
100   LAWRENCE    KATHY    NJ  201/812-3337
101    NEWKIRK   SANDRA    NJ  201/812-3331
109   BAREFOOT   JOSEPH    NJ  201/812-5665
<class 'pandas.core.frame.DataFrame'>
Index: 15 entries, 17 to 109
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   LNAME   15 non-null     object
 1   FNAME   15 non-null     object
 2   STATE   15 non-null     object
 3   HPHONE  15 non-null     object
dtypes: object(4)
memory usage: 600.0+ bytes

In [30]:
# Sample #2

# Drop the specified columns
df_highwage = df5.drop(['SEX', 'BIRTH', 'HIRED'], axis=1)

# Create the CATEGORY column based on conditions
df_highwage['CATEGORY'] = np.where(df_highwage['SALARY'] > 60000, 'High',
                                   np.where(df_highwage['SALARY'] < 30000, 'Low', 'Avg'))

# Assuming SALARY is in uppercase, adjust formatting to currency style for display
# Note: This conversion is purely for display purposes and converts the column to strings.
df_highwage['SALARY'] = df_highwage['SALARY'].apply(lambda x: f"${x:,.2f}")

print(df_highwage)
df_highwage.info()

    IDNUM JOBCODE      SALARY CATEGORY
0    1009     TA1  $28,880.00      Low
1    1017     TA3  $40,858.00      Avg
2    1036     TA3  $39,392.00      Avg
3    1037     TA1  $28,558.00      Low
4    1038     TA1  $26,533.00      Low
..    ...     ...         ...      ...
143  1970     FA1  $22,615.00      Low
144  1983     FA3  $33,419.00      Avg
145  1988     FA3  $32,217.00      Avg
146  1991     TA1  $27,645.00      Low
147  1995     ME1  $28,810.00      Low

[148 rows x 4 columns]
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   IDNUM     148 non-null    object
 1   JOBCODE   148 non-null    object
 2   SALARY    148 non-null    object
 3   CATEGORY  148 non-null    object
dtypes: object(4)
memory usage: 4.8+ KB

In [31]:
# Sample #3

# Rename the column in df8 for the merge
df8_renamed = df8.rename(columns={'SUPID': 'IDNUM'})

# Merge df7 and df8 on IDNUM, indicating records from df8 with the 'super' indicator
combined = pd.merge(df7, df8_renamed, on='IDNUM', how='inner', indicator='super')

# Filter to keep only the records from df8 (SAMDAT8)
combined = combined[combined['super'] == 'both']

# The 'super' column was used as an indicator. If not needed, you can drop it
combined.drop('super', axis=1, inplace=True)

# Display the combined DataFrame
print("Libname Sample 3: Supervisor Information")
combined

Libname Sample 3: Supervisor Information

,IDNUM,LNAME,FNAME,CITY,STATE_x,HPHONE,STATE_y,JOBCAT
0,1106,MARSHBURN,JASPER,STAMFORD,CT,203/781-1457,CT,PT
1,1118,DENNIS,ROGER,NEW YORK,NY,718/383-1122,NY,PT
2,1126,KIMANI,ANNE,NEW YORK,NY,212/586-1229,NY,TA
3,1352,RIVERS,SIMON,NEW YORK,NY,718/383-3345,NY,NA
4,1385,RAYNOR,MILTON,BRIDGEPORT,CT,203/675-2846,CT,ME
5,1401,ALVAREZ,CARLOS,PATERSON,NJ,201/732-8787,NJ,TA
6,1405,DACKO,JASON,PATERSON,NJ,201/732-2323,NJ,SC
7,1417,NEWKIRK,WILLIAM,PATERSON,NJ,201/732-6611,NJ,NA
8,1420,ROUSE,JEREMY,PATERSON,NJ,201/732-9834,NJ,ME
9,1431,YOUNG,DEBORAH,STAMFORD,CT,203/781-2987,CT,FA
10,1433,YANCEY,ROBIN,PRINCETON,NJ,201/812-1874,NJ,FA
11,1442,NEWKIRK,SANDRA,PRINCETON,NJ,201/812-3331,NJ,PT
12,1564,WALTERS,ANNE,NEW YORK,NY,212/587-3257,NY,SC
13,1639,CARTER-COHEN,KAREN,STAMFORD,CT,203/781-8839,CT,TA
14,1677,KRAMER,JACKSON,BRIDGEPORT,CT,203/675-7432,CT,BC
15,1834,LEBLANC,RUSSELL,NEW YORK,NY,718/384-0040,NY,BC
16,1882,TUCKER,ALAN,NEW YORK,NY,718/384-0216,NY,ME
17,1935,FERNANDEZ,KATRINA,BRIDGEPORT,CT,203/675-2962,CT,NA
18,1983,DEAN,SHARON,NEW YORK,NY,718/384-1647,NY,FA

In [32]:
df5

    IDNUM SEX JOBCODE   SALARY      BIRTH      HIRED
0    1009   M     TA1  28880.0 1959-03-02 1992-03-26
1    1017   M     TA3  40858.0 1957-12-28 1981-10-16
2    1036   F     TA3  39392.0 1965-05-19 1984-10-23
3    1037   F     TA1  28558.0 1964-04-10 1992-09-13
4    1038   F     TA1  26533.0 1969-11-09 1991-11-23
..    ...  ..     ...      ...        ...        ...
143  1970   F     FA1  22615.0 1964-09-25 1991-03-12
144  1983   F     FA3  33419.0 1962-02-28 1987-04-27
145  1988   M     FA3  32217.0 1959-11-30 1984-09-18
146  1991   F     TA1  27645.0 1972-05-07 1992-12-12
147  1995   F     ME1  28810.0 1973-08-24 1993-09-19

[148 rows x 6 columns]

In [33]:
df5.info()
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   IDNUM    148 non-null    object
 1   SEX      148 non-null    object
 2   JOBCODE  148 non-null    object
 3   SALARY   148 non-null    float64
 4   BIRTH    148 non-null    datetime64[ns]
 5   HIRED    148 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 7.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   IDNUM    12 non-null     object
 1   SEX      12 non-null     object
 2   JOBCODE  12 non-null     object
 3   SALARY   12 non-null     float64
 4   BIRTH    12 non-null     datetime64[ns]
 5   HIRED    12 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 708.0+ bytes

In [34]:
# Sample #4 

# First, ensure that IDNUM is the index, to align with SAS's by-statement functionality
df5.set_index('IDNUM', inplace=True, drop=False)
df6.set_index('IDNUM', inplace=True, drop=False)

# Perform the update operation: for existing indexes, update df5's rows with df6's
# Note: The combine_first method works by filling in missing values in df5 with values from df6
# This is slightly different from SAS's update, which replaces values even if they are not missing
# For a true "update" as SAS does (overwriting existing values), more complex logic is needed
payroll = df6.combine_first(df5)

# Reset the index to move IDNUM back to a column (if desired)
payroll.reset_index(drop=True, inplace=True)

# Display the title and the DataFrame
print('Libname Sample 4: Updated Payroll Data')
payroll

Libname Sample 4: Updated Payroll Data

    IDNUM SEX JOBCODE   SALARY      BIRTH      HIRED
0    1009   M     TA1  28880.0 1959-03-02 1992-03-26
1    1017   M     TA3  40858.0 1957-12-28 1981-10-16
2    1036   F     TA3  42465.0 1965-05-19 1984-10-23
3    1037   F     TA1  28558.0 1964-04-10 1992-09-13
4    1038   F     TA1  26533.0 1969-11-09 1991-11-23
..    ...  ..     ...      ...        ...        ...
145  1983   F     FA3  33419.0 1962-02-28 1987-04-27
146  1988   M     FA3  32217.0 1959-11-30 1984-09-18
147  1991   F     TA1  27645.0 1972-05-07 1992-12-12
148  1995   F     ME1  28810.0 1973-08-24 1993-09-19
149  1998   M     SCP  23100.0 1970-09-10 1992-11-02

[150 rows x 6 columns]

In [35]:
# Sample #5

# Group by JOBCODE and calculate the sum of SALARY for each group
salary_totals = df5.groupby('JOBCODE')['SALARY'].sum().reset_index()

# Rename columns to match SAS output
salary_totals.columns = ['Jobcode', 'Total for Group']

# Format the 'Total for Group' column as currency for display
# Note: This converts the values to strings, so do this only for final display purposes
salary_totals['Total for Group'] = salary_totals['Total for Group'].apply(lambda x: f"${x:,.2f}")

# Display the DataFrame
print("Libname Sample 5: Total Salary by Jobcode")
salary_totals

Libname Sample 5: Total Salary by Jobcode

   Jobcode Total for Group
0      BCK     $232,148.00
1      FA1     $253,433.00
2      FA2     $447,790.00
3      FA3     $230,537.00
4      ME1     $228,002.00
5      ME2     $498,076.00
6      ME3     $296,875.00
7      NA1     $210,161.00
8      NA2     $157,149.00
9      PT1     $543,264.00
10     PT2     $879,252.00
11     PT3     $221,009.00
12     SCP     $128,162.00
13     TA1     $249,492.00
14     TA2     $671,499.00
15     TA3     $476,155.00

In [36]:
# LIBNAME Sample 6: Flights to London and Frankfurt

# Assuming df2 corresponds to SAMDAT2 and is already loaded

# Filter df2 for rows where DEST is 'FRA' (Frankfurt) or 'LON' (London)
flights_filtered = df2[(df2['DEST'] == 'FRA') | (df2['DEST'] == 'LON')]

# Order the results by DEST
flights_sorted = flights_filtered.sort_values(by='DEST')

# Display the DataFrame
print("Libname Sample 6: Flights to London and Frankfurt")
flights_sorted[['DATES', 'DEST']]

Libname Sample 6: Flights to London and Frankfurt

        DATES DEST
3  1998-03-01  FRA
10 1998-03-02  FRA
17 1998-03-03  FRA
24 1998-03-04  FRA
31 1998-03-05  FRA
42 1998-03-07  FRA
2  1998-03-01  LON
9  1998-03-02  LON
16 1998-03-03  LON
23 1998-03-04  LON
30 1998-03-05  LON
36 1998-03-06  LON
41 1998-03-07  LON

In [37]:
# LIBNAME Sample 7: International Flights by Flight Number with Over 200 Passengers

# Filter df3 for flights with more than 200 passengers boarded
flights_over_200 = df3[df3['BOARDED'] > 200]

# Order the results by FLIGHT
flights_sorted = flights_over_200.sort_values(by='FLIGHT')

# Display the DataFrame
print("Libname Sample 7: International Flights by Flight Number with Over 200 Passengers")
flights_sorted[['FLIGHT', 'DATES', 'DEST', 'BOARDED']]

Libname Sample 7: International Flights by Flight Number with Over 200 Passengers

   FLIGHT      DATES DEST  BOARDED
12    219 1998-03-04  LON    232.0
22    219 1998-03-07  LON    241.0
1     622 1998-03-01  FRA    207.0
23    622 1998-03-07  FRA    210.0

In [38]:
df5 = dfs['parquetdataset\\samdat5']
df6 = dfs['parquetdataset\\samdat6']
df7 = dfs['parquetdataset\\samdat7']

df7

    IDNUM      LNAME      FNAME        CITY STATE        HPHONE
0    1009     MORGAN     GEORGE    NEW YORK    NY  212/586-7753
1    1017      WELCH     DARIUS    NEW YORK    NY  212/586-5535
2    1036       WONG     LESLIE    NEW YORK    NY  212/587-2570
3    1037       CHOW       JANE    STAMFORD    CT  203/781-8868
4    1038  RODRIGUEZ      MARIA  BRIDGEPORT    CT  203/675-2048
..    ...        ...        ...         ...   ...           ...
143  1970     PARKER       ANNE    NEW YORK    NY  718/383-3895
144  1983       DEAN     SHARON    NEW YORK    NY  718/384-1647
145  1988     COOPER    ANTHONY    NEW YORK    NY  212/587-1228
146  1991     HOWARD   GRETCHEN  BRIDGEPORT    CT  203/675-0007
147  1995     VARNER  ELIZABETH    NEW YORK    NY  718/384-7113

[148 rows x 6 columns]

In [39]:
# If IDNUM is a column, ensure it's not duplicated as an index
df7 = df7.reset_index(drop=True)
df5 = df5.reset_index(drop=True)

# Merge DataFrames on 'IDNUM'
merged_df = pd.merge(df7, df5, on='IDNUM', suffixes=('_a', '_b'))

In [40]:
# LIBNAME Sample 8: Employees with salary greater than $40,000

# If IDNUM is a column, ensure it's not duplicated as an index
df7 = df7.reset_index(drop=True)
df5 = df5.reset_index(drop=True)

# Merge DataFrames on 'IDNUM'
merged_df = pd.merge(df7, df5, on='IDNUM', suffixes=('_a', '_b'))

# Filter for employees with salary greater than $40,000
employees_over_40k = merged_df[merged_df['SALARY'] > 40000]

# Format the 'SALARY' column as currency for display
# Note: This converts the values to strings, so do this only for final display purposes
employees_over_40k['SALARY'] = employees_over_40k['SALARY'].apply(lambda x: f"${x:,.2f}")

# Display the filtered and formatted DataFrame
print("Libname Sample 8: Employees with salary greater than $40,000")
employees_over_40k[['LNAME', 'FNAME', 'SALARY']]

Libname Sample 8: Employees with salary greater than $40,000

C:\Users\comma\AppData\Local\Temp\ipykernel_17776\135138160.py:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  employees_over_40k['SALARY'] = employees_over_40k['SALARY'].apply(lambda x: f"${x:,.2f}")

            LNAME      FNAME       SALARY
1           WELCH     DARIUS   $40,858.00
7          VENTER    RANDALL   $66,558.00
15      MARSHBURN     JASPER   $89,632.00
16       THOMPSON      WAYNE   $89,977.00
17         RHODES     JEREMY   $40,586.00
24         DENNIS      ROGER  $111,379.00
32         KIMANI       ANNE   $40,899.00
45         CASTON   FRANKLIN   $41,690.00
47     STEPHENSON       ADAM   $42,178.00
48       BANADYGA     JUSTIN   $88,606.00
49         O'NEAL      BRYAN   $40,079.00
51         RIVERS      SIMON   $53,798.00
56         MORGAN     ALFRED   $42,264.00
58         RAYNOR     MILTON   $43,900.00
65          COHEN        LEE   $91,376.00
68      GREGORSKI     DANIEL   $68,096.00
70        HAVELKA    RAYMOND   $41,551.00
71         HARRIS    CHARLES   $84,685.00
77        NEWKIRK    WILLIAM   $52,270.00
79          ROUSE     JEREMY   $43,071.00
87          BRADY  CHRISTINE   $68,767.00
98     HASENHAUER  CHRISTINA   $70,736.00
101       NEWKIRK     SANDRA   $84,536.00
102         WELLS      AGNES   $42,274.00
106        NEWTON      JAMES   $84,203.00
109      BAREFOOT     JOSEPH   $43,025.00
110        PARKER        JAY   $41,526.00
111       HERRERO      CLYDE   $66,130.00
113    PENNINGTON    MICHAEL   $71,349.00
118  CARTER-COHEN      KAREN   $40,260.00
125    BRANCACCIO     JOSEPH   $66,517.00
126        LUFKIN        ROY  $109,630.00
129         TRIPP      KATHY   $84,471.00
131        NORRIS      DIANE   $43,433.00
134        TUCKER       ALAN   $41,538.00
135    STEPHENSON     ROBERT   $91,908.00
137        GRAHAM      ALVIN   $65,111.00
141      UPCHURCH      LARRY   $89,858.00
142     FERNANDEZ    KATRINA   $51,081.00

In [41]:
# 9

# Ensure the necessary columns are not set as indexes
df1 = df1.reset_index(drop=True)
df2 = df2.reset_index(drop=True)
df3 = df3.reset_index(drop=True)

# Merge df1 with df2 on both FLIGHT and DATES
merged_df1_2 = pd.merge(df1, df2, on=['FLIGHT', 'DATES'])

In [42]:
# Merge the result with df3 on FLIGHT (assuming DELAY column is in df3)
merged_all = pd.merge(merged_df1_2, df3, on=['FLIGHT'])

# Filter for delayed flights (DELAY > 0)
delayed_flights = merged_all[merged_all['DELAY'] > 0]

In [43]:
delayed_flights

,FLIGHT,DATES_x,DEPART,ORIG_x,DEST_x,MILES,BOARDED_x,CAPACITY,ORIG_y,DEST_y,DELAYCAT,DESTYPE,DELAY,DATES_y,DEST,BOARDED_y
0,132,1998-03-01,56100.0,LGA,YYZ,366.0,115.0,178.0,LGA,YYZ,11+ Minutes,International,14.0,1998-03-01,YYZ,115.0
1,132,1998-03-01,56100.0,LGA,YYZ,366.0,115.0,178.0,LGA,YYZ,11+ Minutes,International,14.0,1998-03-02,YYZ,106.0
2,132,1998-03-01,56100.0,LGA,YYZ,366.0,115.0,178.0,LGA,YYZ,11+ Minutes,International,14.0,1998-03-03,YYZ,75.0
3,132,1998-03-01,56100.0,LGA,YYZ,366.0,115.0,178.0,LGA,YYZ,11+ Minutes,International,14.0,1998-03-04,YYZ,117.0
4,132,1998-03-01,56100.0,LGA,YYZ,366.0,115.0,178.0,LGA,YYZ,11+ Minutes,International,14.0,1998-03-05,YYZ,157.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
165,622,1998-03-07,44340.0,LGA,FRA,3857.0,210.0,250.0,LGA,FRA,11+ Minutes,International,21.0,1998-03-02,FRA,176.0
166,622,1998-03-07,44340.0,LGA,FRA,3857.0,210.0,250.0,LGA,FRA,11+ Minutes,International,21.0,1998-03-03,FRA,180.0
167,622,1998-03-07,44340.0,LGA,FRA,3857.0,210.0,250.0,LGA,FRA,11+ Minutes,International,21.0,1998-03-04,FRA,137.0
168,622,1998-03-07,44340.0,LGA,FRA,3857.0,210.0,250.0,LGA,FRA,11+ Minutes,International,21.0,1998-03-05,FRA,185.0
169,622,1998-03-07,44340.0,LGA,FRA,3857.0,210.0,250.0,LGA,FRA,11+ Minutes,International,21.0,1998-03-07,FRA,210.0

In [44]:
# 9

# Ensure the necessary columns are not set as indexes
df1 = df1.reset_index(drop=True)
df2 = df2.reset_index(drop=True)
df3 = df3.reset_index(drop=True)

# Merge df1 with df2 on both FLIGHT and DATES
merged_df1_2 = pd.merge(df1, df2, on=['FLIGHT', 'DATES'])

# Merge the result with df3 on FLIGHT (assuming DELAY column is in df3)
merged_all = pd.merge(merged_df1_2, df3, on=['FLIGHT'])

# Filter for delayed flights (DELAY > 0)
delayed_flights = merged_all[merged_all['DELAY'] > 0]

# Select distinct rows and sort by DELAY in descending order
# Assuming DELAY column comes from one of the datasets (e.g., df1) without column name conflict
# If there are conflicts, you might need suffixes in merges and adjust the column names accordingly
delayed_flights_sorted = delayed_flights[['FLIGHT', 'DATES', 'DELAY']].drop_duplicates().sort_values(by='DELAY', ascending=False)

print("Libname Sample 9a: Delayed International Flights in March")
delayed_flights_sorted

KeyError: "['DATES'] not in index"

In [ ]:
# Sample 10

# For an accurate outer union correlation, ensure both DataFrames have the same columns
# This step might involve adding missing columns as NaN in both DataFrames or adjusting as needed
# Here, it's assumed that the necessary columns exist and are aligned

# Perform the concatenation, equivalent to an outer union corr
combined_df = pd.concat([df5[['IDNUM', 'SEX', 'JOBCODE', 'SALARY', 'BIRTH', 'HIRED']], df6], ignore_index=True)

# Sort by the specified columns
combined_df_sorted = combined_df.sort_values(by=['IDNUM', 'JOBCODE', 'SALARY'])

# Assuming you want to print or display this DataFrame
print("Libname Sample 10: Payrolls 1 & 2")
combined_df_sorted

Libname Sample 10: Payrolls 1 & 2

    IDNUM SEX JOBCODE   SALARY      BIRTH      HIRED
0    1009   M     TA1  28880.0 1959-03-02 1992-03-26
1    1017   M     TA3  40858.0 1957-12-28 1981-10-16
2    1036   F     TA3  39392.0 1965-05-19 1984-10-23
148  1036   F     TA3  42465.0 1965-05-19 1984-10-23
160  1036   F     TA3  42465.0 1965-05-19 1984-10-23
..    ...  ..     ...      ...        ...        ...
145  1988   M     FA3  32217.0 1959-11-30 1984-09-18
146  1991   F     TA1  27645.0 1972-05-07 1992-12-12
147  1995   F     ME1  28810.0 1973-08-24 1993-09-19
159  1998   M     SCP  23100.0 1970-09-10 1992-11-02
171  1998   M     SCP  23100.0 1970-09-10 1992-11-02

[172 rows x 6 columns]

In [ ]:
# Sample 12
#Filter out rows where STATE equals 'CT'
df7_filtered = df7[df7['STATE'] != 'CT']

# Display the updated DataFrame, which excludes employees from Connecticut
print("Libname Sample 12: AIRLINE.SAMDAT7 After Deleting Connecticut Employees")
df7_filtered

Libname Sample 12: AIRLINE.SAMDAT7 After Deleting Connecticut Employees

    IDNUM     LNAME      FNAME          CITY STATE        HPHONE
0    1009    MORGAN     GEORGE      NEW YORK    NY  212/586-7753
1    1017     WELCH     DARIUS      NEW YORK    NY  212/586-5535
2    1036      WONG     LESLIE      NEW YORK    NY  212/587-2570
5    1050    TUTTLE     THOMAS  WHITE PLAINS    NY  914/455-2119
6    1065     COPAS  FREDERICO      NEW YORK    NY  718/384-5618
..    ...       ...        ...           ...   ...           ...
141  1928  UPCHURCH      LARRY  WHITE PLAINS    NY  914/455-5009
143  1970    PARKER       ANNE      NEW YORK    NY  718/383-3895
144  1983      DEAN     SHARON      NEW YORK    NY  718/384-1647
145  1988    COOPER    ANTHONY      NEW YORK    NY  212/587-1228
147  1995    VARNER  ELIZABETH      NEW YORK    NY  718/384-7113

[104 rows x 6 columns]

In [ ]:
#Sample 14 part 1

# Group by FLIGHT and DATES, then sum up BOARDED
passengers_per_flight_date = df1.groupby(['FLIGHT', 'DEST', 'DATES'])['BOARDED'].sum().reset_index()

print("Libname Sample 14: Number of Passengers per Flight by Date")
print(passengers_per_flight_date)

Libname Sample 14: Number of Passengers per Flight by Date
   FLIGHT DEST      DATES  BOARDED
0     114  LAX 1998-03-01    172.0
1     114  LAX 1998-03-02    119.0
2     114  LAX 1998-03-03    197.0
3     114  LAX 1998-03-04    178.0
4     114  LAX 1998-03-05    117.0
5     114  LAX 1998-03-06    128.0
6     114  LAX 1998-03-07    160.0
7     132  YYZ 1998-03-01    115.0
8     132  YYZ 1998-03-02    106.0
9     132  YYZ 1998-03-03     75.0
10    132  YYZ 1998-03-04    117.0
11    132  YYZ 1998-03-05    157.0
12    132  YYZ 1998-03-06    150.0
13    132  YYZ 1998-03-07    164.0
14    202  ORD 1998-03-01    151.0
15    202  ORD 1998-03-02    120.0
16    202  ORD 1998-03-03    118.0
17    202  ORD 1998-03-04    148.0
18    202  ORD 1998-03-05    104.0
19    202  ORD 1998-03-06    115.0
20    202  ORD 1998-03-07    175.0
21    219  LON 1998-03-01    198.0
22    219  LON 1998-03-02    147.0
23    219  LON 1998-03-03    197.0
24    219  LON 1998-03-04    232.0
25    219  LON 1998-03-05    160.0
26    219  LON 1998-03-06    163.0
27    219  LON 1998-03-07    241.0
28    271  PAR 1998-03-01    138.0
29    271  PAR 1998-03-02    104.0
30    271  PAR 1998-03-03    147.0
31    271  PAR 1998-03-04    146.0
32    271  PAR 1998-03-05    177.0
33    271  PAR 1998-03-07    155.0
34    302  WAS 1998-03-01    105.0
35    302  WAS 1998-03-02     78.0
36    302  WAS 1998-03-03    123.0
37    302  WAS 1998-03-04    115.0
38    302  WAS 1998-03-06     66.0
39    302  WAS 1998-03-07    135.0
40    622  FRA 1998-03-01    207.0
41    622  FRA 1998-03-02    176.0
42    622  FRA 1998-03-03    180.0
43    622  FRA 1998-03-04    137.0
44    622  FRA 1998-03-05    185.0
45    622  FRA 1998-03-07    210.0

In [ ]:
#Sample 14 part 2

# Group by FLIGHT and calculate the max of BOARDED
max_passengers_per_flight = df1.groupby('FLIGHT')['BOARDED'].max().reset_index()

print("Libname Sample 14: Maximum Number of Passengers per Flight")
print(max_passengers_per_flight)

Libname Sample 14: Maximum Number of Passengers per Flight
  FLIGHT  BOARDED
0    114    197.0
1    132    164.0
2    202    175.0
3    219    241.0
4    271    177.0
5    302    135.0
6    622    210.0

In [ ]:
# Sample 15 with glob
# Specify the directory where your dataset files are stored, including a wildcard to match all files
dataset_directory = 'C:/Users/comma/GitRepo/sas-access-samples/SAS Foundation/parquetdataset/'

# Use glob.glob to list all files in the directory
dataset_files = glob.glob(dataset_directory)

# Print the list of dataset file names
print("Libname Sample 15: Table Listing")
for file_path in dataset_files:
    print(file_path.split('/')[-1])

Libname Sample 15: Table Listing

In [ ]:
#Sample 15 with os
# Specify the directory where your dataset files are stored
dataset_directory = 'C:/Users/comma/GitRepo/sas-access-samples/SAS Foundation/parquetdataset/'

# List all files in the directory
dataset_files = os.listdir(dataset_directory)

# Print the list of dataset file names
print("Libname Sample 15: Table Listing")
for file in dataset_files:
    print(file.split('.')[-2])

Libname Sample 15: Table Listing
samdat1
samdat10
samdat11
samdat12
samdat13
samdat2
samdat3
samdat4
samdat5
samdat6
samdat7
samdat8
samdat9

In [ ]:
# Sample 16
# Display the title
print("Libname Sample 16: Contents of the SAMDAT2 Table")

# Use the DataFrame.info() method to print information about df2
df2.info()

Libname Sample 16: Contents of the SAMDAT2 Table
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FLIGHT    46 non-null     object
 1   DATES     46 non-null     datetime64[ns]
 2   ORIG      46 non-null     object
 3   DEST      46 non-null     object
 4   DELAYCAT  46 non-null     object
 5   DESTYPE   46 non-null     object
 6   DELAY     46 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 2.6+ KB

In [ ]:
#Sample 17
# Rank the DELAY column in descending order, handling ties by assigning the minimum rank in the group (equivalent to ties='low')
df2['RANKING'] = df2['DELAY'].rank(method='min', ascending=False)

# Sort the DataFrame based on the rank to make the printout more meaningful
ranked_df = df2.sort_values(by='RANKING')

# Optionally, you can format the DELAY column, though this step is purely for display purposes in SAS
# In Pandas, formatting for display typically happens at the display/output level rather than changing the DataFrame

# Display the DataFrame with formatted DELAY
print("Libname Sample 17: Ranking of Delayed Flights")
#print(ranked_df[['DELAY', 'RANKING']].head())  # .head() to display the first few rows similar to PROC PRINT
ranked_df

Libname Sample 17: Ranking of Delayed Flights

   FLIGHT      DATES ORIG DEST      DELAYCAT        DESTYPE  DELAY  RANKING
24    622 1998-03-04  LGA  FRA   11+ Minutes  International   30.0      1.0
36    219 1998-03-06  LGA  LON   11+ Minutes  International   27.0      2.0
42    622 1998-03-07  LGA  FRA   11+ Minutes  International   21.0      3.0
2     219 1998-03-01  LGA  LON   11+ Minutes  International   18.0      4.0
9     219 1998-03-02  LGA  LON   11+ Minutes  International   18.0      4.0
41    219 1998-03-07  LGA  LON   11+ Minutes  International   15.0      6.0
21    114 1998-03-04  LGA  LAX   11+ Minutes       Domestic   15.0      6.0
4     132 1998-03-01  LGA  YYZ   11+ Minutes  International   14.0      8.0
0     114 1998-03-01  LGA  LAX  1-10 Minutes       Domestic    8.0      9.0
37    132 1998-03-06  LGA  YYZ  1-10 Minutes  International    7.0     10.0
27    302 1998-03-04  LGA  WAS  1-10 Minutes       Domestic    7.0     10.0
18    132 1998-03-03  LGA  YYZ  1-10 Minutes  International    6.0     12.0
20    302 1998-03-03  LGA  WAS  1-10 Minutes       Domestic    5.0     13.0
33    271 1998-03-05  LGA  PAR  1-10 Minutes  International    5.0     13.0
11    132 1998-03-02  LGA  YYZ  1-10 Minutes  International    5.0     13.0
8     202 1998-03-02  LGA  ORD  1-10 Minutes       Domestic    5.0     13.0
5     271 1998-03-01  LGA  PAR  1-10 Minutes  International    5.0     13.0
26    271 1998-03-04  LGA  PAR  1-10 Minutes  International    5.0     13.0
16    219 1998-03-03  LGA  LON  1-10 Minutes  International    4.0     19.0
44    271 1998-03-07  LGA  PAR  1-10 Minutes  International    4.0     19.0
12    271 1998-03-02  LGA  PAR  1-10 Minutes  International    4.0     19.0
32    132 1998-03-05  LGA  YYZ  1-10 Minutes  International    3.0     22.0
30    219 1998-03-05  LGA  LON  1-10 Minutes  International    3.0     22.0
23    219 1998-03-04  LGA  LON  1-10 Minutes  International    3.0     22.0
29    202 1998-03-05  LGA  ORD  1-10 Minutes       Domestic    2.0     25.0
19    271 1998-03-03  LGA  PAR  1-10 Minutes  International    2.0     25.0
38    302 1998-03-06  LGA  WAS  1-10 Minutes       Domestic    1.0     27.0
45    302 1998-03-07  LGA  WAS      No Delay       Domestic    0.0     28.0
10    622 1998-03-02  LGA  FRA      No Delay  International    0.0     28.0
13    302 1998-03-02  LGA  WAS      No Delay       Domestic    0.0     28.0
7     114 1998-03-02  LGA  LAX      No Delay       Domestic    0.0     28.0
15    202 1998-03-03  LGA  ORD      No Delay       Domestic   -1.0     32.0
14    114 1998-03-03  LGA  LAX      No Delay       Domestic   -1.0     32.0
34    114 1998-03-06  LGA  LAX      No Delay       Domestic   -1.0     32.0
39    114 1998-03-07  LGA  LAX      No Delay       Domestic   -1.0     32.0
43    132 1998-03-07  LGA  YYZ      No Delay  International   -2.0     36.0
40    202 1998-03-07  LGA  ORD      No Delay       Domestic   -2.0     36.0
6     302 1998-03-01  LGA  WAS      No Delay       Domestic   -2.0     36.0
28    114 1998-03-05  LGA  LAX      No Delay       Domestic   -2.0     36.0
17    622 1998-03-03  LGA  FRA      No Delay  International   -2.0     36.0
35    202 1998-03-06  LGA  ORD      No Delay       Domestic   -3.0     41.0
3     622 1998-03-01  LGA  FRA      No Delay  International   -5.0     42.0
1     202 1998-03-01  LGA  ORD      No Delay       Domestic   -5.0     42.0
25    132 1998-03-04  LGA  YYZ      No Delay  International   -5.0     42.0
22    202 1998-03-04  LGA  ORD      No Delay       Domestic   -5.0     42.0
31    622 1998-03-05  LGA  FRA      No Delay  International   -6.0     46.0

In [ ]:
#Sample 17a
samtemp = df2.copy()

# Mimicking the deletion of SAMTEMP
del samtemp

In [ ]:
#Sample 18
# Count the number of employees by JOBCODE
employees_by_jobcode = df5['JOBCODE'].value_counts().reset_index()

# Rename columns to match the expected output
employees_by_jobcode.columns = ['JOBCODE', '#']

# Sort by JOBCODE to mimic the default behavior of proc tabulate
employees_by_jobcode.sort_values(by='JOBCODE', inplace=True)

# Display the title
print("Libname Sample 18: Number of Employees by Jobcode")

# Display the results
print(employees_by_jobcode)

Libname Sample 18: Number of Employees by Jobcode
   JOBCODE   #
8      BCK   9
4      FA1  12
2      FA2  16
9      FA3   9
12     ME1   8
3      ME2  14
10     ME3   9
13     NA1   5
15     NA2   3
7      PT1   9
5      PT2  10
14     PT3   3
11     SCP   8
6      TA1   9
0      TA2  20
1      TA3  16

In [ ]:
# Sample 19
# Append df6 to df5
df5_appended = pd.concat([df5, df6], ignore_index=True)

# Display the title
print("Libname Sample 19: SAMDAT5 After Appending SAMDAT6")

# Display the appended DataFrame
# Note: In a script, you might print a subset of rows to avoid overwhelming the console
print(df5_appended)

Libname Sample 19: SAMDAT5 After Appending SAMDAT6
    IDNUM SEX JOBCODE   SALARY      BIRTH      HIRED
0    1009   M     TA1  28880.0 1959-03-02 1992-03-26
1    1017   M     TA3  40858.0 1957-12-28 1981-10-16
2    1036   F     TA3  39392.0 1965-05-19 1984-10-23
3    1037   F     TA1  28558.0 1964-04-10 1992-09-13
4    1038   F     TA1  26533.0 1969-11-09 1991-11-23
..    ...  ..     ...      ...        ...        ...
167  1369   M     TA3  36598.0 1961-12-28 1987-03-13
168  1447   F     FA1  22123.0 1972-08-07 1992-10-29
169  1561   M     TA3  36514.0 1963-11-30 1987-10-07
170  1639   F     TA3  42260.0 1957-06-26 1984-01-28
171  1998   M     SCP  23100.0 1970-09-10 1992-11-02

[172 rows x 6 columns]

In [ ]:
# Sample 20
# Keep only the INVNUM and COUNTRY columns, similar to the SAS keep= option
df9_filtered = df9[['INVNUM', 'COUNTRY']]

# Calculate the frequency of each country
country_frequency = df9_filtered['COUNTRY'].value_counts().reset_index()

# Rename columns to make the output clearer
country_frequency.columns = ['COUNTRY', 'FREQUENCY']

# Display the title
print("Libname Sample 20: Invoice Frequency by Country")

# Display the frequency table
print(country_frequency)

Libname Sample 20: Invoice Frequency by Country
     COUNTRY  FREQUENCY
0        USA         10
1     Brazil          4
2  Argentina          2
3  Australia          1

In [ ]:
# Sample 21

allinv = df9[['PAIDON', 'BILLEDON', 'INVNUM', 'AMTINUS', 'BILLEDTO']].head(5)
notpaid = allinv[pd.isna(allinv['PAIDON']) & (allinv['AMTINUS'] >= 300000.00)].copy()
notpaid = notpaid[['INVNUM', 'BILLEDTO', 'AMTINUS', 'BILLEDON']]
# Format the AMTINUS column for display
notpaid['AMTINUS'] = notpaid['AMTINUS'].apply(lambda x: f"${x:,.2f}")

# Print the DataFrame with labels as a description
print("Libname Sample 21: High Bills--Not Paid")
print("Column Labels: AMTINUS=amountinus, BILLEDON=billedon, INVNUM=invoicenum, BILLEDTO=billedto")
print(notpaid)

Libname Sample 21: High Bills--Not Paid
Column Labels: AMTINUS=amountinus, BILLEDON=billedon, INVNUM=invoicenum, BILLEDTO=billedto
    INVNUM  BILLEDTO         AMTINUS   BILLEDON
1  11271.0  18543489  $11,063,836.00 1998-10-05

In [ ]:
#Sample 22
emp_csr = df10[df10['DEPT'].isin(['CSR010', 'CSR011', 'CSR004'])]
family_members = pd.merge(emp_csr, df13, left_on='EMPID', right_on='FAMILYID', how='inner')
# Select specific columns and rename them to match SAS output with all caps
#family_members
result = family_members[['LASTNAME_y', 'FIRSTNAM', 'EMPID_y', 'FAMILYID',  'GENDER_y', 'DEPT_y', 'HIREDATE_y']]
result.columns = ['LASTNAME', 'FIRSTNAME', 'EMPID', 'FAMILYID', 'GENDER', 'DEPT', 'HIREDATE']
# Capitalize all column names
result.columns = [col.upper() for col in result.columns]
# Display results
print("Libname Sample 22: Interns Who Are Family Members of Employees")
result

Libname Sample 22: Interns Who Are Family Members of Employees

           LASTNAME FIRSTNAME     EMPID  FAMILYID GENDER    DEPT   HIREDATE
0             SMITH    ROBERT  765112.0  234967.0      M  CSR010 1998-05-04
1  NISHIMATSU-LYNCH   RICHARD  765111.0  677890.0      M  CSR011 1998-05-04

In [ ]:
#Sample 23
flight_df = df1[df1['DEST'] == 'WAS'][['FLIGHT', 'DATES', 'ORIG', 'DEST']]
print (flight_df)

   FLIGHT      DATES ORIG DEST
34    302 1998-03-01  LGA  WAS
35    302 1998-03-02  LGA  WAS
36    302 1998-03-03  LGA  WAS
37    302 1998-03-04  LGA  WAS
38    302 1998-03-06  LGA  WAS
39    302 1998-03-07  LGA  WAS

In [ ]:
#Sample 9
# Merge df1 with df2 on FLIGHT and DATES
# merged_df1_2 = pd.merge(df1, df2, on=['FLIGHT', 'DATES'])
merged_df1_2 = pd.merge(df1, df2, on=['FLIGHT', 'DATES'], suffixes=('_from_df1', '_from_df2'))

# Merge the result with df3 on FLIGHT (assuming DELAY column is in df1 or df3, adjust accordingly)
merged_all = pd.merge(merged_df1_2, df3, on='FLIGHT')

# Filter for delayed flights (DELAY > 0)
delayed_flights = merged_all[merged_all['DELAY'] > 0].drop_duplicates()

# Order the results by DELAY in descending order
delayed_flights_sorted = delayed_flights.sort_values(by='DELAY', ascending=False)
print("Libname Sample 9a: Delayed International Flights in March")
#print(delayed_flights_sorted[['FLIGHT', 'DATES', 'DELAY']])
#print(merged_df1_2)
#print(merged_all)
#print("Columns in merged_all:", merged_all.columns)
#print(delayed_flights)
print(delayed_flights_sorted)

Libname Sample 9a: Delayed International Flights in March
    FLIGHT    DATES_x   DEPART ORIG_from_df1 DEST_from_df1   MILES  BOARDED_x  \
157    622 1998-03-04  44340.0           LGA           FRA  3857.0      137.0
156    622 1998-03-04  44340.0           LGA           FRA  3857.0      137.0
155    622 1998-03-04  44340.0           LGA           FRA  3857.0      137.0
154    622 1998-03-04  44340.0           LGA           FRA  3857.0      137.0
153    622 1998-03-04  44340.0           LGA           FRA  3857.0      137.0
..     ...        ...      ...           ...           ...     ...        ...
113    271 1998-03-03  47820.0           LGA           PAR  3635.0      147.0
112    271 1998-03-03  47820.0           LGA           PAR  3635.0      147.0
111    271 1998-03-03  47820.0           LGA           PAR  3635.0      147.0
110    271 1998-03-03  47820.0           LGA           PAR  3635.0      147.0
115    271 1998-03-03  47820.0           LGA           PAR  3635.0      147.0

     CAPACITY ORIG_from_df2 DEST_from_df2      DELAYCAT        DESTYPE  DELAY  \
157     250.0           LGA           FRA   11+ Minutes  International   30.0
156     250.0           LGA           FRA   11+ Minutes  International   30.0
155     250.0           LGA           FRA   11+ Minutes  International   30.0
154     250.0           LGA           FRA   11+ Minutes  International   30.0
153     250.0           LGA           FRA   11+ Minutes  International   30.0
..        ...           ...           ...           ...            ...    ...
113     250.0           LGA           PAR  1-10 Minutes  International    2.0
112     250.0           LGA           PAR  1-10 Minutes  International    2.0
111     250.0           LGA           PAR  1-10 Minutes  International    2.0
110     250.0           LGA           PAR  1-10 Minutes  International    2.0
115     250.0           LGA           PAR  1-10 Minutes  International    2.0

       DATES_y DEST  BOARDED_y
157 1998-03-07  FRA      210.0
156 1998-03-05  FRA      185.0
155 1998-03-04  FRA      137.0
154 1998-03-03  FRA      180.0
153 1998-03-02  FRA      176.0
..         ...  ...        ...
113 1998-03-04  PAR      146.0
112 1998-03-03  PAR      147.0
111 1998-03-02  PAR      172.0
110 1998-03-01  PAR      138.0
115 1998-03-07  PAR      155.0

[132 rows x 16 columns]

In [ ]:
# Sample 9
# Merge df1 with df2 on both 'FLIGHT' and 'DATES'
merged_df1_2 = pd.merge(df1, df2, on=['FLIGHT', 'DATES'], how='outer', suffixes=('_df1', '_df2'))

# Merge the result with df3 on both 'FLIGHT' and 'DATES'
merged_all = pd.merge(merged_df1_2, df3, on=['FLIGHT', 'DATES'], how='outer', suffixes=('_df12', '_df3'))

# Assuming DELAY is from df1 and correctly included in merged_all
delayed_flights = merged_all[merged_all['DELAY'] > 0].drop_duplicates()

# Sort by 'DELAY' in descending order
delayed_flights_sorted = delayed_flights.sort_values(by='DELAY', ascending=False)

print("Libname Sample 9a: Delayed International Flights in March")
#print(delayed_flights_sorted[['FLIGHT', 'DATES', 'DELAY']])
delayed_flights_sorted[['FLIGHT', 'DATES', 'DELAY']]

Libname Sample 9a: Delayed International Flights in March

   FLIGHT      DATES  DELAY
43    622 1998-03-04   30.0
26    219 1998-03-06   27.0
45    622 1998-03-07   21.0
21    219 1998-03-01   18.0
22    219 1998-03-02   18.0
27    219 1998-03-07   15.0
3     114 1998-03-04   15.0
7     132 1998-03-01   14.0
0     114 1998-03-01    8.0
12    132 1998-03-06    7.0
37    302 1998-03-04    7.0
9     132 1998-03-03    6.0
8     132 1998-03-02    5.0
28    271 1998-03-01    5.0
15    202 1998-03-02    5.0
31    271 1998-03-04    5.0
32    271 1998-03-05    5.0
36    302 1998-03-03    5.0
23    219 1998-03-03    4.0
29    271 1998-03-02    4.0
33    271 1998-03-07    4.0
25    219 1998-03-05    3.0
24    219 1998-03-04    3.0
11    132 1998-03-05    3.0
18    202 1998-03-05    2.0
30    271 1998-03-03    2.0
38    302 1998-03-06    1.0

In [ ]:
# Sample 11

enginename = "ASTER" 

df8.columns = ['EMPID', 'STATE', 'CODE']

# Check the engine condition and insert data accordingly
if enginename == 'ASTER':
    new_row = {'EMPID': 1588, 'STATE': 'NY', 'CODE': 'FA'}
else:
    new_row = {'EMPID': '1588', 'STATE': 'NY', 'CODE': 'FA'}

df8 = df8.append(new_row, ignore_index=True)
print(df8)

AttributeError: 'DataFrame' object has no attribute 'append'

In [ ]:
enginename = "ASTER"  # This would be set based on your application's logic or configuration



# Assuming df8 represents SAMDAT8 and is already initialized elsewhere in your code
# Example initialization if not already done:
# df8 = pd.DataFrame(columns=['EMPID', 'STATE', 'CODE'])
df8.columns = ['EMPID', 'STATE', 'CODE']
# Check the engine condition and insert data accordingly
if enginename == 'ASTER':
    new_row = {'EMPID': 1588, 'STATE': 'NY', 'CODE': 'FA'}
else:
    new_row = {'EMPID': '1588', 'STATE': 'NY', 'CODE': 'FA'}

# Append the row to the DataFrame
df8 = df8.append(new_row, ignore_index=True)

# Capitalize column names
df8.columns = [col.upper() for col in df8.columns]

# Display the DataFrame with a title
print("Libname Sample 11: New Row in AIRLINE.SAMDAT8")
print(df8)

:

In [ ]:
# Find indices of rows where EMPID equals 1588
indices_to_drop = df8[df8['EMPID'] == 1588].index

# Drop these rows from the DataFrame
df8.drop(indices_to_drop, inplace=True)
print(df8)

   EMPID STATE CODE
0   1106    CT   PT
1   1118    NY   PT
2   1126    NY   TA
3   1352    NY   NA
4   1385    CT   ME
5   1401    NJ   TA
6   1405    NJ   SC
7   1417    NJ   NA
8   1420    NJ   ME
9   1431    CT   FA
10  1433    NJ   FA
11  1442    NJ   PT
12  1564    NY   SC
13  1639    CT   TA
14  1677    CT   BC
15  1834    NY   BC
16  1882    NY   ME
17  1935    CT   NA
18  1983    NY   FA
19  1588    NY   FA
20  1588    NY   FA

In [ ]:
#Sample 11
enginename = "ASTER"  # This would be set based on your application's logic or configuration

# df8 = pd.DataFrame(columns=['EMPID', 'STATE', 'CODE'])
df8.columns = ['EMPID', 'STATE', 'CODE']
# Check the engine condition and insert data accordingly
if enginename == 'ASTER':
    new_row = pd.DataFrame({'EMPID': [1588], 'STATE': ['NY'], 'CODE': ['FA']})
else:
    new_row = pd.DataFrame({'EMPID': ['1588'], 'STATE': ['NY'], 'CODE': ['FA']})

# Use pd.concat to add the new row to df8
df8 = pd.concat([df8, new_row], ignore_index=True)

# Capitalize column names
df8.columns = [col.upper() for col in df8.columns]

# Display the DataFrame with a title
print("Libname Sample 11: New Row in AIRLINE.SAMDAT8")
print(df8)

Libname Sample 11: New Row in AIRLINE.SAMDAT8
   EMPID STATE CODE
0   1106    CT   PT
1   1118    NY   PT
2   1126    NY   TA
3   1352    NY   NA
4   1385    CT   ME
5   1401    NJ   TA
6   1405    NJ   SC
7   1417    NJ   NA
8   1420    NJ   ME
9   1431    CT   FA
10  1433    NJ   FA
11  1442    NJ   PT
12  1564    NY   SC
13  1639    CT   TA
14  1677    CT   BC
15  1834    NY   BC
16  1882    NY   ME
17  1935    CT   NA
18  1983    NY   FA
19  1588    NY   FA
20  1588    NY   FA
21  1588    NY   FA

In [ ]:
# Sample 13

# Perform an inner join
merged_df = pd.merge(df7, df5, on='IDNUM', suffixes=('_a', '_b'))

# Filter for employees with a salary greater than $40,000
high_earners = merged_df[merged_df['SALARY'] > 40000]

# Select and rename columns
high_earners = high_earners[['LNAME', 'FNAME', 'SALARY']]
high_earners.rename(columns={'LNAME': 'LASTNAME', 'FNAME': 'FIRSTNAME', 'SALARY': 'SALARY'}, inplace=True)

# Format the SALARY column for display as currency

In [ ]:
# Sample 13

# Perform an inner join
merged_df = pd.merge(df7, df5, on='IDNUM')

# Filter for employees with a salary greater than $40,000
high_earners = merged_df[merged_df['SALARY'] > 40000]

# Select and rename columns
high_earners = high_earners[['LNAME', 'FNAME', 'SALARY']]
high_earners.rename(columns={'LNAME': 'LASTNAME', 'FNAME': 'FIRSTNAME', 'SALARY': 'SALARY'}, inplace=True)

# Format the SALARY column for display as currency
high_earners['SALARY'] = high_earners['SALARY'].apply(lambda x: f"${x:,.2f}")

# Print the results
print("Libname Sample 13: Employees with salaries over $40,000")
high_earners

Libname Sample 13: Employees with salaries over $40,000

         LASTNAME  FIRSTNAME       SALARY
1           WELCH     DARIUS   $40,858.00
3            WONG     LESLIE   $42,465.00
9          VENTER    RANDALL   $66,558.00
10         VENTER    RANDALL   $69,742.00
18      MARSHBURN     JASPER   $89,632.00
19      MARSHBURN     JASPER   $94,039.00
20       THOMPSON      WAYNE   $89,977.00
21         RHODES     JEREMY   $40,586.00
28         DENNIS      ROGER  $111,379.00
36         KIMANI       ANNE   $40,899.00
51         CASTON   FRANKLIN   $41,690.00
53     STEPHENSON       ADAM   $42,178.00
54       BANADYGA     JUSTIN   $88,606.00
55         O'NEAL      BRYAN   $40,079.00
58         RIVERS      SIMON   $53,798.00
64         MORGAN     ALFRED   $42,264.00
66         RAYNOR     MILTON   $43,900.00
73          COHEN        LEE   $91,376.00
76      GREGORSKI     DANIEL   $68,096.00
78        HAVELKA    RAYMOND   $41,551.00
79         HARRIS    CHARLES   $84,685.00
85        NEWKIRK    WILLIAM   $52,270.00
87          ROUSE     JEREMY   $43,071.00
95          BRADY  CHRISTINE   $68,767.00
106    HASENHAUER  CHRISTINA   $70,736.00
109       NEWKIRK     SANDRA   $84,536.00
110         WELLS      AGNES   $42,274.00
114        NEWTON      JAMES   $84,203.00
117      BAREFOOT     JOSEPH   $43,025.00
118        PARKER        JAY   $41,526.00
119       HERRERO      CLYDE   $66,130.00
121    PENNINGTON    MICHAEL   $71,349.00
127  CARTER-COHEN      KAREN   $40,260.00
128  CARTER-COHEN      KAREN   $42,260.00
135    BRANCACCIO     JOSEPH   $66,517.00
136        LUFKIN        ROY  $109,630.00
139         TRIPP      KATHY   $84,471.00
141        NORRIS      DIANE   $43,433.00
144        TUCKER       ALAN   $41,538.00
145    STEPHENSON     ROBERT   $91,908.00
147        GRAHAM      ALVIN   $65,111.00
151      UPCHURCH      LARRY   $89,858.00
152     FERNANDEZ    KATRINA   $51,081.00